app/controllers/api/v1/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("user_id", "todo_name", "todo_type", "todo_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"